PeterVranken/TRK-USB-MPC5643L/LSM/printf/code/serial/lfd_linFlexDriver.c
/**
 * @file lfd_linFlexDriver.c
 * Support of the LINFlex device of the MPC5643L. The device is configured as UART and fed
 * by DMA. We get a serial RS 232 output channel of high throughput with a minimum of CPU
 * interaction.\n
 *   Input is done by interrupt on a received character. The bandwidth of the input channel
 * is by far lower than the output. This is fine for the normal use case, controlling an
 * application by some input commands, but would become a problem if the intention is to
 * download large data chunks, e.g. for a kind of bott loader.\n
 *   The API is a small set of basic read and write routines, which adopt the conventions
 * of the C standard library so that the C functions for formatted output become usable.
 * (Formmated input is not possible through C standrad functions.)
 *
 * Copyright (C) 2017 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   ldf_initSerialInterface
 *   lfd_writeSerial
 * Local functions
 *   initPBridge
 *   initDMA
 *   initLINFlex
 *   dmaCh15Interrupt
 *   linFlex0RxInterrupt
 *   registerInterrupts
 */

/*
 * Include files
 */

#include <unistd.h>
#include <stdatomic.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "lfd_linFlexDriver.h"
#include "ihw_initMcuCoreHW.h"



/*
 * Defines
 */
 
/** The DMA channel to serve the UART with sent data bytes. */
/// @todo Make channel selectable: The implementation doesn't respectthis macro yet
#define DMA_CHN_FOR_SERIAL_OUTPUT   15

/** The interrupt priority for serial output. The interrupt is requested by the DMA when
    all bytes of the last recently initiated transfer are sent.
      @remark The chosen priority needs to be greater or equal than the priority of any
    context, that makes use of the API functions of this module. */
#define INTC_PRIO_IRQ_DMA_FOR_SERIAL_OUTPUT     1

/** The interrupt priority for serial input. The interrupt is requested by the UART when
    another byte has been received.
      @remark The chosen priority needs to be greater or equal than the priority of any
    context, that makes use of the API functions of this module.
      @remark Because of the larger UART buffer applied for serial output, this priority
    should normally be chosen higher than #INTC_PRIO_IRQ_DMA_FOR_SERIAL_OUTPUT. */
#define INTC_PRIO_IRQ_UART_FOR_SERIAL_INPUT     2

/** The size of the ring buffer can be chosen as a power of two of bytes.
      @remark Note, the permitted range of values depends on the reservation of space made
    in the linker control file. */
#define SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO   10

/** Compute the size of the ring buffer as number of bytes. */
#define SERIAL_OUTPUT_RING_BUFFER_SIZE  (1u<<(SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO)) 

/** Used for index arithemtics: A mask for those index bits in an integer word. */
#define SERIAL_OUTPUT_RING_BUFFER_IDX_MASK  (SERIAL_OUTPUT_RING_BUFFER_SIZE-1)


/*
 * Local type definitions
 */
 
 
/*
 * Local prototypes
 */
 
 
/*
 * Data definitions
 */
 
/** This development support variable counts the number of DMA transfers intiated since
    power-up, to do the serial output */
volatile unsigned long lfd_serialOutNoDMATransfers = 0;

/** The ring buffer for serial output can be memntarily full. In such a case a sent message
    can be truncated (from a few bytes shortend up to entirely lost). This development
    support variable counts the number of message since power-up, which underwent
    trunction. */
volatile unsigned long lfd_serialOutNoTruncatedMsgs = 0;

/** The ring buffer for serial output can be memntarily full. In such a case a sent message
    can be truncated (from a few bytes shortend up to entirely lost). This development
    support variable counts the number of truncated, lost message characters since
    power-up. */
volatile unsigned long lfd_serialOutNoLostMsgBytes = 0;

/** The ring buffer used for the DMA based serial output.
      @remark The size of the buffer is defined here in the C source code but there is a strong
    dependency on the linker control file, too. The log2(sizeOfBuffer) least significant
    bits of the buffer address need to be zero. The buffer address (and thus its alignment)
    is specified in the linker file, which therefore limits the maximum size of the buffer. */
static uint8_t SECTION(.heap.dmaRingBuffer) _serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE];

/** The write index into the ring buffer used for serial output. Since we use bytes and
    since the log2(sizeOfBuffer) least significant bits of the buffer address are be zero
    the address of the index element is \a _serialOutRingBuf | \a _serialOutRingBufIdxWrM,
    which is equal to \a _serialOutRingBuf + \a _serialOutRingBufIdxWrM.
      @remark The variable is only used modulo SERIAL_OUTPUT_RING_BUFFER_SIZE, i.e. the more
    significant bits don't care (but aren't necessarily zero). This is indicated by the M
    at the end of the name. */
static volatile unsigned int _serialOutRingBufIdxWrM = 0;

/** On-DMA-Complete interrupt and API function lfd_writeSerial need to share the
    information, whether a transfer is currently running. The flag is set when all elder
    output had been completed and the client code demand a new output. It is reset when a
    DMA transfer completes and the client code has not demanded a new output meanwhile. */
static volatile bool _serialOutDmaTransferIsRunning = false;


volatile unsigned long lfd_noRxBytes = 0;
static volatile unsigned char _readBuf[512]
                            , *_pRdBuf = &_readBuf[0];
static const unsigned char *_pRdBufEnd = &_readBuf[0] + sizeof(_readBuf);
static unsigned int _noEOL = 0;

unsigned long lfd_read_noInvocations = 0;
int lfd_read_fildes = -99;
void *lfd_read_buf = (void*)-99;
size_t lfd_read_nbytes = 99;
unsigned int lfd_read_noErrors = 0
           , lfd_read_noLostBytes = 0;
           

 
