PeterVranken/TRK-USB-MPC5643L/LSM/printf/code/serial/lfd_linFlexDriver.c
        /* Enable the UART to request bytes from the DMA. This initiates a subsequent DMA
           transfer. */
        ++ lfd_serialOutNoDMATransfers;
        EDMA.DMASERQ.R = 15;
    }            
    else
    {
        /* No subsequent DMA transfer is immediately initiated, so the application code
           will need to start one the next time the API function lfd_writeSerial is
           called. */
        _serialOutDmaTransferIsRunning = false;
    }
#undef MODULO
} /* End of dmaCh15Interrupt */



/**
 * Interrupt handler for UART RX event.
 */
static void linFlex0RxInterrupt(void)
{
    ++ lfd_noRxBytes;
    
    /* Get the received byte and put it into our buffer. */
    const unsigned char c = LINFLEX_0.BDRM.B.DATA4;
    if(_pRdBuf < _pRdBufEnd)
    {
        * _pRdBuf++ = c;
        if(c == '\n')
            ++ _noEOL;
    }
    
    /// @todo Record a buffer overrun bit in case the IRQ handler comes too slow
    
    /* Acknowlege the interrupt and enable the next one at the same time. */
    assert((LINFLEX_0.UARTSR.R & 0x4) != 0);
    LINFLEX_0.UARTSR.R = 0x4;  
    
} /* End of linFlex0RxInterrupt */



/**
 * Our locally implemented interrupt handlers are registered at the operating system for
 * serving the required I/O devices (DMA and LINFlex 0 or 1).
 */
static void registerInterrupts(void)
{
/* Interrupt offsets taken from MCU reference manual, p. 936.
     26: DMA, channel 15. */
#define IDX_DMA_IRQ         (11+DMA_CHN_FOR_SERIAL_OUTPUT)
#define IDX_LINFLEX0_RX_IRQ (79)

    /* Register our IRQ handlers. Priority is chosen low for output DMA since we serve a
       slow data channel, which even has a four Byte queue inside. */
    /// @todo Priorities to be aligned with rest of application, consider intended RTOS
    ihw_installINTCInterruptHandler( &dmaCh15Interrupt
                                   , /* vectorNum */ IDX_DMA_IRQ
                                   , /* psrPriority */ INTC_PRIO_IRQ_DMA_FOR_SERIAL_OUTPUT
                                   , /* isPreemptable */ true
                                   );
    ihw_installINTCInterruptHandler( &linFlex0RxInterrupt
                                   , /* vectorNum */ IDX_LINFLEX0_RX_IRQ
                                   , /* psrPriority */ INTC_PRIO_IRQ_UART_FOR_SERIAL_INPUT
                                   , /* isPreemptable */ true
                                   );
#undef IDX_DMA_IRQ 
#undef IDX_LINFLEX0_RX_IRQ
} /* End of registerInterrupts */



/**
 * Initialize the I/O devices for serial output, in particular, these are the LINFlex
 * device plus a DMA channel to serve it.
 *   @param baudRate
 * The Baud rate of in- and output.
 *   @todo Selection of DMA channel and LINFlex device should become an option
 *   @remark
 * This function needs to be called at system initialization phase, when all External
 * Interrupts are still suspended.
 */
void ldf_initSerialInterface(unsigned int baudRate)
{
    initLINFlex(baudRate);

    /* Register the interrupt handler for DMA. */
    registerInterrupts();
    
    /* Initialize DMA and connect it to the UART. An initial hello world string is
       transmitted. */
    initDMA();

    // Don't test here, no interrupts are running yet
    //const char msg[] = "Hello World!\r\n";
    //static volatile int noBytesWritten_;
    //noBytesWritten_ = write(stdout->_file, msg, sizeof(msg)-1);

} /* End of ldf_initSerialInterface */



/** 
 * Pricipal API function for data output. A byte string is sent through the serial
 * interface. Actually, the bytes are queued for sending and the function is non-blocking. 
 *   @return
 * The number of queued bytes is returned. Normally, this is the same value as argument \a
 * noBytes. However, the byte sequence can be longer than the currently available space in
 * the send buffer. (Its size is fixed and no reallocation strategy is implemented.) The
 * tranmitted message will be truncated if the return value is less than function argument
 * \a noBytes.
 *   @param msg
 * The byte sequence to send. Note, this may be but is not necessarily a C string with zero
 * terminations. Zero bytes can be send, too.
 *   @param noBytes
 * The number of bytes to send. For a C string, this will mostly be \a strlen(msg).
 */
signed int lfd_writeSerial(const void *msg, unsigned int noBytes)
{
    /// @todo limit to buffersize -1 to avoid overflow in address computation
    uint32_t msr = ihw_enterCriticalSection();
    {
        /* Note, most buffer addresses or indexes in this section of the code are
           understood as cylic, i.e. modulo the buffer size. This is indicated by an M as
           last character of the affectzed symbols but not mentioned again in the code
           comments. */
#define MODULO(bufIdx)    ((bufIdx) & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK)

        /* The current, i.e. next, transfer address of the DMA is the first (cyclic) address,
           which we must not touch when filling the buffer. This is the (current) end of
           the free buffer area. */
        const uint32_t idxEndOfFreeSpaceM = EDMA.CHANNEL[15].TCDWORD0_.B.SADDR;
        
        /* The cyclic character of the buffer can require one or two copy operations to
           place the message. We compute the concrete index ranges to copy.
             Note the -1: Same index values are used as empty-buffer-indication. Therefore
           it is not possible to entirely fill the buffer. */
        const unsigned int noBytesFree =
                                MODULO(idxEndOfFreeSpaceM - _serialOutRingBufIdxWrM - 1);
         
        /* Avoid buffer overrun by saturation of the user demand and report the number of
           overrun events and the number of lost message characters. */
        if(noBytes > noBytesFree)
        {
            ++ lfd_serialOutNoTruncatedMsgs;
            lfd_serialOutNoLostMsgBytes += noBytes - noBytesFree;
            noBytes = noBytesFree;
        }
        
        /* How many bytes would fit until we have to wrap? This limits the first copy
           operation. */
        unsigned int noBytesTillEnd = MODULO(SERIAL_OUTPUT_RING_BUFFER_SIZE
                                             - _serialOutRingBufIdxWrM
                                            )
                   , noBytesAtEnd;
        if(noBytes <= noBytesTillEnd)
        {
            /* The message fits into the rest of the linear buffer, no wrapping required. */
            noBytesAtEnd = noBytes;
        }
        else
        {
            /* A portion of the message is placed at the end of the linear buffer and the
               rest of the message at its beginning. */
            noBytesAtEnd = noBytesTillEnd;
        }
               
        /* Always copy the first part of the message to the current end of the linear
           buffer. */
        uint8_t * const pDest = &_serialOutRingBuf[MODULO(_serialOutRingBufIdxWrM)];
        assert(pDest + noBytesAtEnd <= &_serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE]);
        memcpy(pDest, msg, noBytesAtEnd);
        
        /* Copy the second part of the message at the beginning of the linear buffer if
           there is a remainder. */
        if(noBytes > noBytesAtEnd)
        {
            assert(noBytes - noBytesAtEnd < sizeof(_serialOutRingBuf));
            memcpy(&_serialOutRingBuf[0], msg+noBytesAtEnd, noBytes-noBytesAtEnd);
        }           
        
        _serialOutRingBufIdxWrM = _serialOutRingBufIdxWrM + noBytes;

