PeterVranken/TRK-USB-MPC5643L/LSM/printf/code/serial/lfd_linFlexDriver.c
        /* Start DMA only if there's no currently running transfer (from a write of
           before). If there is such a running transfer then the next transfer will be
           initiated from its on-complete-interrupt. */
        if(noBytes > 0  &&  !_serialOutDmaTransferIsRunning)
        {
            /* Set the number of bytes to transfer by DMA to the UART. */
            assert((unsigned)noBytes <= SERIAL_OUTPUT_RING_BUFFER_SIZE-1);
            EDMA.CHANNEL[15].TCDWORD28_.B.BITER = noBytes;
            EDMA.CHANNEL[15].TCDWORD20_.B.CITER = noBytes;

            /* Enable the DMA channel to accept the UART's requests for bytes. This
               initiates a DMA transfer.
                 NOP, 0x80: 1: Ignore write to register (to permit 32 Bit access to more
               than one of these byte registers at a time)
                 SERQ0, 0x40: 0: Address channel with SERQ, 1: Enable all channels
                 SERQ, 0xf: Channel number */
            atomic_thread_fence(memory_order_seq_cst);
            ++ lfd_serialOutNoDMATransfers;
            EDMA.DMASERQ.R = 15;

            /* The status, whether we have currently started a transfer or not is shared
               with the on-complete-interrupt. */
            _serialOutDmaTransferIsRunning = true;
        }
#undef MODULO
    }
    ihw_leaveCriticalSection(msr);
    
    /* noBytes is saturated to buffer size-1 and can't overflow in conversion to signed. */
    return (signed int)noBytes;
    
} /* End of lfd_writeSerial */




#if 0
/// @todo Let the write API with file ID become part of the printf compilation unit
signed int write(int file, const void *msg, size_t noBytes)
{
    /// @todo Do we need EOL conversion? Likely yes
    /// @todo Write elipsis (...) in case of buffer-full caused truncation. This requires beforehand computation of possible length
    
    if(noBytes == 0  ||  msg == NULL  ||  (file != stdout->_file  &&  file != stderr->_file))
        return 0;
    else
        return lfd_writeSerial(msg, noBytes);
        
} /* End of write */


/// @todo This API belongs into the printf module. We need a raw read char or read line
ssize_t read(int fildes, void *buf, size_t nbytes)
{
    ++ lfd_read_noInvocations;
    lfd_read_fildes = fildes;
    lfd_read_buf = buf;
    lfd_read_nbytes = nbytes;

    ssize_t result;
    uint32_t msr = ihw_enterCriticalSection();
    {
        const unsigned int noCharsReceived = (unsigned int)(_pRdBuf - &_readBuf[0]);
        assert(noCharsReceived <= sizeof(_readBuf));
        
        /* Normally the clib request a maximum of data, so that the error situation of
           having more characters received as requested will normally not happen. */
        if(nbytes < noCharsReceived)
        {
            ++ lfd_read_noErrors;
            lfd_read_noLostBytes += noCharsReceived - nbytes;
        }
        
        if(nbytes > 0  &&  noCharsReceived == 0)
        {
            /* Catch the case, which is not intended by the blocking clib function: We need
               but we don't have any character. We return an error code. If we simply
               return 0 bytes the clib will not come back to ask later for more
               characters.
                 Note, this attempt to make the clib patiently waiting for later input
               doesn't work neither. Its internal buffer handling seems to be corrupted,
               the character strings returned to gets depend on our data but is not the
               same; fragments are repeated, instead of returning nothing.
                 Incorrect work around: We return an EOL, which actually isn't in the
               stream. Some input functions from the clib will return the empty string,
               which is s bit of correct. */
            *(char*)buf = '\n';
            result = 1;
        }
        else if(nbytes == 0)
            result = 0;
        else
        {
            if(nbytes > noCharsReceived)
                nbytes = noCharsReceived;

            /* Extract data and clear buffer. */
            memcpy(buf, (const void*)&_readBuf[0], nbytes);
            _pRdBuf = &_readBuf[0];
            _noEOL = 0;
            
            result = (ssize_t)nbytes;
        }        
    }
    ihw_leaveCriticalSection(msr);

    return result;

} /* End of read */
#endif



